{
  "brand": {
    "name": "Rajpreet"
  },
  "about": {
    "name": "Rajpreet Singh Nayyar",
    "kicker": "Hi, I’m",
    "title": "VP, Lead Software Engineer | C# • .NET Core • Java Spring Boot • Checkout & Loyalty Systems",
    "bio": "VP, Lead Software Engineer specializing in travel e-commerce Checkout, loyalty, and rewards systems. I design and operate reliable, API-driven platforms with a focus on clean system design, production reliability, and scalable decisioning logic.",
    "image": "assets/rajpreet.png",
    "resumeUrl": "assets/Rajpreet-Singh-Nayyar-Resume.pdf",
    "resumeFileName": "Rajpreet-Singh-Nayyar-Resume.pdf"
  },
  "quickLinks": [
    {
      "type": "linkedin",
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/rajpreetnayyar"
    },
    {
      "type": "github",
      "label": "GitHub",
      "url": "https://github.com/"
    },
    {
      "type": "email",
      "label": "Email",
      "url": "mailto:rajpreetsinghnayyar@gmail.com"
    }
  ],
  "work": {
    "timeline": [
      {
        "period": "Feb 2026 — Present",
        "location": "Plano, TX • USA",
        "role": "VP, Lead Software Engineer",
        "company": "JPMorgan Chase & Co.",
        "companyLogo": "assets/logo-jpmc.svg",
        "team": "Chase Travel • Cart, Checkout & Loyalty",
        "description": "Leading technical strategy and execution for Checkout and Loyalty platforms within Chase Travel, focusing on scalability, reliability, and complex reward decisioning systems.",
        "achievements": [
          "Provide technical leadership for Cart, Checkout, and Loyalty platforms supporting large-scale travel e-commerce.",
          "Drive system design, architectural direction, and engineering standards across distributed backend services.",
          "Guide teams on production reliability, observability, and evolution of rules-heavy reward and promotion systems.",
          "Partner closely with product, business, and platform stakeholders to deliver resilient, customer-facing Checkout experiences."
        ]
      },
      {
        "period": "Oct 2023 — Jan 2026",
        "location": "Plano, TX • USA",
        "role": "Associate Software Engineer III",
        "company": "JPMorgan Chase & Co.",
        "companyLogo": "assets/logo-jpmc.svg",
        "team": "Chase Travel • Cart & Checkout",
        "description": "Subject Matter Expert for Checkout loyalty and promotions with strong ownership of production reliability and rewards initiatives.",
        "achievements": [
          "Served as SME for Cart & Checkout, owning technical and business workflows across booking, rewards, and purchase flows.",
          "Led knowledge transfer and enablement for US-based teams through architecture walkthroughs and production-readiness reviews.",
          "Provided heavy production support including SEV triage, root-cause analysis, and resolution in partnership with SRE teams.",
          "Delivered major initiatives including Dynamic Burn, Preserve Burn, Chase Promotions, and Cruise onboarding.",
          "Designed and implemented a dynamic reward points allocation algorithm for Preserve Burn and presented the solution during on-site workshops in India prior to go-live."
        ]
      },
      {
        "period": "Jan 2022 — Sep 2023",
        "location": "Pune, MH • India",
        "role": "Associate Software Engineer II",
        "company": "JPMorgan Chase & Co.",
        "companyLogo": "assets/logo-jpmc.svg",
        "team": "Chase Travel • Cart & Checkout",
        "description": "Code owner for Cart Engine with squad-level delivery leadership across Checkout initiatives.",
        "achievements": [
          "Owned Cart Engine architecture, code quality, and daily code reviews.",
          "Led cross-functional squads delivering Fee in Points and Traveler Information Page initiatives.",
          "Contributed to capacity planning, estimation, roadmap discussions, and full-stack development.",
          "Supported multiple client launches and participated in on-site solutioning sessions in Plano, Texas.",
          "Built real-time observability dashboards using Grafana and Kibana and monitored systems using Dynatrace."
        ]
      },
      {
        "period": "Jul 2019 — Dec 2021",
        "location": "Pune, MH • India",
        "role": "Associate Software Engineer",
        "company": "JPMorgan Chase & Co.",
        "companyLogo": "assets/logo-jpmc.svg",
        "team": "Chase Travel • Cart & Payments",
        "description": "Backend and UI engineering across Cart, Checkout, and Payments platforms.",
        "achievements": [
          "Developed backend APIs using C# and .NET Core across Cart, Payments, Fraud, and Compliance services.",
          "Implemented asynchronous processing using RabbitMQ and improved system throughput.",
          "Worked on Angular-based Checkout UI using microservices and BFF patterns.",
          "Improved monitoring and observability using Grafana, Kibana, and Dynatrace.",
          "Applied TDD, code coverage, and centralized configuration management."
        ]
      },
      {
        "period": "Jul 2018 — Jul 2019",
        "location": "Pune, MH • India",
        "role": "Software Engineer Intern",
        "company": "Tavisca Solutions Pvt Ltd",
        "companyLogo": "assets/logo-tavisca.svg",
        "team": "ORXe • Data Analytics",
        "description": "Frontend and analytics tooling for internal data analysis platforms.",
        "achievements": [
          "Built Angular-based UI for a data analytics and visualization tool.",
          "Implemented interactive charts using CanvasJS and integrated Angular Material components.",
          "Developed backend email APIs to automate reporting workflows.",
          "Applied Angular fundamentals including routing, services, and directives."
        ]
      }
    ]
  },
  "skills": {
    "groups": [
      {
        "title": "Languages",
        "maxRating": 5,
        "items": [
          { "name": "C#", "rating": 5 },
          { "name": "Java", "rating": 4 },
          { "name": "Python", "rating": 3 },
          { "name": "JavaScript", "rating": 4 }
        ]
      },
      {
        "title": "Frameworks",
        "maxRating": 5,
        "items": [
          { "name": ".NET Core / ASP.NET Core", "rating": 5 },
          { "name": "Spring Boot", "rating": 4 },
          { "name": "Angular", "rating": 4 }
        ]
      }
    ]
  },
  "footerText": "© 2026 Rajpreet Singh Nayyar"
}
